import streamlit as st
import pandas as pd

st.set_page_config(
    page_title="Hello",
    page_icon="👋",
)

st.write("# Описание моделей")

st.markdown(
    """
    В приложении представлено 4 модели:
    - Нейронная сеть
    - Байесовский классификатор
    - Логистическая регрессия
    - Случайный лес (деревья решений)

    Все модели обучены на 234 наблюдениях (80% тренировочная выборка, 20% тестовая)


    В качестве признаков объектов были выбраны следующие:
    - Возраст
    - Фены, Итог
    - Индекс Варге (ИВ) 
    - Эпизоды сердцебиений
    - САДs
    - ИМТ
    - САДd
    - Рост,м
    - Головокружение
    - Вес


    Отбор признаков производился рекурсивно с использованием коэффициента Джини.

    """
)

st.markdown(
    """
    ### Оценка качества Нейронной сети

    Архитектура скрытых слоёв сети: (20, 15, 10, 5).

    В качестве функции активации используется гиперболический тангенс.

    """
)


st.write(
    pd.DataFrame(
        {
            "0.0": {
                "precision": 0.7333333333333333,
                "recall": 0.7857142857142857,
                "f1-score": 0.7586206896551724,
                "support": 14.0,
            },
            "1.0": {
                "precision": 0.90625,
                "recall": 0.8787878787878788,
                "f1-score": 0.8923076923076922,
                "support": 33.0,
            },
            "accuracy": 0.851063829787234,
            "macro avg": {
                "precision": 0.8197916666666667,
                "recall": 0.8322510822510822,
                "f1-score": 0.8254641909814323,
                "support": 47.0,
            },
            "weighted avg": {
                "precision": 0.8547429078014184,
                "recall": 0.851063829787234,
                "f1-score": 0.8524860319431119,
                "support": 47.0,
            },
        }
    ).transpose()
)

st.write("### Оценка качества Байесовского классификатора")

st.write(
    pd.DataFrame(
        {
            "0.0": {
                "precision": 0.7058823529411765,
                "recall": 0.8571428571428571,
                "f1-score": 0.7741935483870968,
                "support": 14.0,
            },
            "1.0": {
                "precision": 0.9333333333333333,
                "recall": 0.8484848484848485,
                "f1-score": 0.888888888888889,
                "support": 33.0,
            },
            "accuracy": 0.851063829787234,
            "macro avg": {
                "precision": 0.8196078431372549,
                "recall": 0.8528138528138528,
                "f1-score": 0.8315412186379929,
                "support": 47.0,
            },
            "weighted avg": {
                "precision": 0.8655819774718398,
                "recall": 0.851063829787234,
                "f1-score": 0.8547243193777168,
                "support": 47.0,
            },
        }
    ).transpose()
)

st.markdown(
    """
    ### Оценка качества Случайного леса

    Случайный лес состоит из 100 деревьев.

    """
)

st.write(
    pd.DataFrame(
        {
            "0.0": {
                "precision": 0.7058823529411765,
                "recall": 0.8571428571428571,
                "f1-score": 0.7741935483870968,
                "support": 14.0,
            },
            "1.0": {
                "precision": 0.9333333333333333,
                "recall": 0.8484848484848485,
                "f1-score": 0.888888888888889,
                "support": 33.0,
            },
            "accuracy": 0.851063829787234,
            "macro avg": {
                "precision": 0.8196078431372549,
                "recall": 0.8528138528138528,
                "f1-score": 0.8315412186379929,
                "support": 47.0,
            },
            "weighted avg": {
                "precision": 0.8655819774718398,
                "recall": 0.851063829787234,
                "f1-score": 0.8547243193777168,
                "support": 47.0,
            },
        }
    ).transpose()
)

st.write("### Оценка качества Логистической регрессии")
st.write(
    pd.DataFrame(
        {
            "0.0": {
                "precision": 0.6428571428571429,
                "recall": 0.6428571428571429,
                "f1-score": 0.6428571428571429,
                "support": 14.0,
            },
            "1.0": {
                "precision": 0.8484848484848485,
                "recall": 0.8484848484848485,
                "f1-score": 0.8484848484848486,
                "support": 33.0,
            },
            "accuracy": 0.7872340425531915,
            "macro avg": {
                "precision": 0.7456709956709957,
                "recall": 0.7456709956709957,
                "f1-score": 0.7456709956709957,
                "support": 47.0,
            },
            "weighted avg": {
                "precision": 0.7872340425531915,
                "recall": 0.7872340425531915,
                "f1-score": 0.7872340425531915,
                "support": 47.0,
            },
        }
    ).transpose()
)
