import streamlit as st
import pandas as pd

st.set_page_config(
    page_title="Hello",
    page_icon="👋",
)

st.write("# Описание моделей")

st.markdown(
    """
    В приложении представлено 4 модели:
    - Нейронная сеть
    - Байесовский классификатор
    - Логистическая регрессия
    - Случайный лес (деревья решений)

    Все модели обучены на 234 наблюдениях (80% тренировочная выборка, 20% тестовая)


    В качестве признаков объектов были выбраны следующие:
    - Рост,м
    - ЧСС ночью Макс
    - САДd
    - САДs
    - Кол-во эпизодов синусовой тахикардии
    - pNN50 день
    - Эпизоды сердцебиений
    - Индекс Варге (ИВ)
    - Фены, Итог
    - Возраст

    Отбор признаков производился рекурсивно с использованием коэффициента Джини.

    """
)

st.markdown(
    """
    ### Оценка качества Нейронной сети

    Архитектура скрытых слоёв сети: (100, 50, 25, 10).

    В качестве функции активации используется гиперболический тангенс.

    """
)


st.write(
    pd.DataFrame(
        {
            "0.0": {
                "precision": 0.6666666666666666,
                "recall": 0.7142857142857143,
                "f1-score": 0.689655172413793,
                "support": 14.0,
            },
            "1.0": {
                "precision": 0.875,
                "recall": 0.8484848484848485,
                "f1-score": 0.8615384615384615,
                "support": 33.0,
            },
            "accuracy": 0.8085106382978723,
            "macro avg": {
                "precision": 0.7708333333333333,
                "recall": 0.7813852813852814,
                "f1-score": 0.7755968169761273,
                "support": 47.0,
            },
            "weighted avg": {
                "precision": 0.8129432624113474,
                "recall": 0.8085106382978723,
                "f1-score": 0.8103391839268581,
                "support": 47.0,
            },
        }
    ).transpose()
)

st.write("### Оценка качества Байесовского классификатора")

st.write(
    pd.DataFrame(
        {
            "0.0": {
                "precision": 0.8,
                "recall": 0.8571428571428571,
                "f1-score": 0.8275862068965518,
                "support": 14.0,
            },
            "1.0": {
                "precision": 0.9375,
                "recall": 0.9090909090909091,
                "f1-score": 0.923076923076923,
                "support": 33.0,
            },
            "accuracy": 0.8936170212765957,
            "macro avg": {
                "precision": 0.86875,
                "recall": 0.8831168831168831,
                "f1-score": 0.8753315649867375,
                "support": 47.0,
            },
            "weighted avg": {
                "precision": 0.8965425531914895,
                "recall": 0.8936170212765957,
                "f1-score": 0.8946328799593656,
                "support": 47.0,
            },
        }
    ).transpose()
)

st.markdown(
    """
    ### Оценка качества Случайного леса

    Случайный лес состоит из 100 деревьев.

    """
)

st.write(
    pd.DataFrame(
        {
            "0.0": {
                "precision": 0.2,
                "recall": 0.21428571428571427,
                "f1-score": 0.20689655172413796,
                "support": 14.0,
            },
            "1.0": {
                "precision": 0.65625,
                "recall": 0.6363636363636364,
                "f1-score": 0.6461538461538462,
                "support": 33.0,
            },
            "accuracy": 0.5106382978723404,
            "macro avg": {
                "precision": 0.428125,
                "recall": 0.4253246753246753,
                "f1-score": 0.4265251989389921,
                "support": 47.0,
            },
            "weighted avg": {
                "precision": 0.520345744680851,
                "recall": 0.5106382978723404,
                "f1-score": 0.5153112478130821,
                "support": 47.0,
            },
        }
    ).transpose()
)

st.write("### Оценка качества Логистической регрессии")
st.write(
    pd.DataFrame(
        {
            "0.0": {
                "precision": 0.7692307692307693,
                "recall": 0.7142857142857143,
                "f1-score": 0.7407407407407408,
                "support": 14.0,
            },
            "1.0": {
                "precision": 0.8823529411764706,
                "recall": 0.9090909090909091,
                "f1-score": 0.8955223880597014,
                "support": 33.0,
            },
            "accuracy": 0.851063829787234,
            "macro avg": {
                "precision": 0.8257918552036199,
                "recall": 0.8116883116883117,
                "f1-score": 0.8181315644002212,
                "support": 47.0,
            },
            "weighted avg": {
                "precision": 0.848656975064985,
                "recall": 0.851063829787234,
                "f1-score": 0.8494172165178835,
                "support": 47.0,
            },
        }
    ).transpose()
)
